<a href="https://colab.research.google.com/github/PeggyK1/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Peggy_Krom_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [14]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-06-04 03:28:50--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.112.205
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.112.205|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  46.1MB/s    in 4.7s

2020-06-04 03:28:55 (42.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [15]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [16]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [17]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
##I need Product Name and Product ID from products, Reordered and product id from both order_prior and order_train

In [0]:
import pandas as pd

products = pd.read_csv('products.csv')

In [19]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [20]:
orders = pd.read_csv('orders.csv')

orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [21]:
order_prior = pd.read_csv('order_products__prior.csv')
print(order_prior.shape)
order_prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [22]:
cols = orders.columns
print(cols)

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'order_dow',
       'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

In [23]:
order_train = pd.read_csv('order_products__train.csv')
print(order_train.shape)
order_train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [24]:
#Concatenating order_prior and order_train by rows
order_products = pd.concat([order_prior, order_train])
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [25]:
#Slimming down product dataset
product_subset = products[['product_id', 'product_name']]
product_subset.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [26]:
#Slimming down order dataset
order_subset = order_products[['product_id', 'reordered']]
order_subset.head()

   product_id  reordered
0       33120          1
1       28985          1
2        9327          0
3       45918          1
4       30035          0

In [27]:
#Condition for similar column (product_id)
condition = product_subset['product_id'].isin(order_subset['product_id'])
product_subset = product_subset[condition]
product_subset.head(10)

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce
5           6                                       Dry Nose Oil
6           7                     Pure Coconut Water With Orange
7           8                  Cut Russet Potatoes Steam N' Mash
8           9                  Light Strawberry Blueberry Yogurt
9          10     Sparkling Orange Juice & Prickly Pear Beverage

In [28]:
#Merging product and order on 'product id' with inner(excluding NaN)
product_orders = pd.merge(product_subset, order_subset, on='product_id', how='inner')
product_orders.head()

   product_id                product_name  reordered
0           1  Chocolate Sandwich Cookies          0
1           1  Chocolate Sandwich Cookies          1
2           1  Chocolate Sandwich Cookies          1
3           1  Chocolate Sandwich Cookies          0
4           1  Chocolate Sandwich Cookies          0

In [29]:
#Calculating reordered values
product_orders['reordered'].value_counts()

1    19955360
0    13863746
Name: reordered, dtype: int64

In [30]:
product_orders['reordered'].isnull().sum()

0

In [33]:
#New total ordered column
product_orders['ordered'] = (product_orders['product_name'].value_counts())
product_orders['ordered'].head()

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: ordered, dtype: float64

In [32]:
product_orders['ordered'].tail()

33819101   NaN
33819102   NaN
33819103   NaN
33819104   NaN
33819105   NaN
Name: ordered, dtype: float64

In [89]:
product_orders['reordered'].dtype

dtype('int64')

In [88]:
product_orders['total_ordered'] = product_orders['ordered'] + product['reordered']
product_orders['total_ordered'].head()

NameError: ignored

In [34]:
#Calculating top 10 value counts
product_orders['product_name'].value_counts().head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [43]:
#Creating Top Ten dataset
top_ten = product_orders['product_name'].value_counts().head(10)
print(top_ten)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [44]:
top_ten = top_ten.reset_index()
top_ten

                    index  product_name
0                  Banana        491291
1  Bag of Organic Bananas        394930
2    Organic Strawberries        275577
3    Organic Baby Spinach        251705
4    Organic Hass Avocado        220877
5         Organic Avocado        184224
6             Large Lemon        160792
7            Strawberries        149445
8                   Limes        146660
9      Organic Whole Milk        142813

In [45]:
top_ten1 = top_ten.rename(columns={
    'index': 'Product Name',
    'product_name': 'Ordered'
})
top_ten1

             Product Name  Ordered
0                  Banana   491291
1  Bag of Organic Bananas   394930
2    Organic Strawberries   275577
3    Organic Baby Spinach   251705
4    Organic Hass Avocado   220877
5         Organic Avocado   184224
6             Large Lemon   160792
7            Strawberries   149445
8                   Limes   146660
9      Organic Whole Milk   142813

In [52]:
#Making it prettier the hard way
# top_ten = pd.DataFrame(
#     [['Banana', 491291],
#      ['Bag of Organic Bananas', 394930],
#      ['Organic Strawberries', 275577],
#      ['Organic Baby Spinach', 251705],
#      ['Organic Hass Avocado', 220877],
#      ['Organic Avocado', 184224],
#      ['Large Lemon', 160792],
#      ['Strawberries', 149445],
#      ['Limes', 146660],
#      ['Organic Whole Milk', 142813]],
#     index=['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
#     columns=['Product', 'Ordered'])
  
 

# print(top_ten)

                   Product  Ordered
1                   Banana   491291
2   Bag of Organic Bananas   394930
3     Organic Strawberries   275577
4     Organic Baby Spinach   251705
5     Organic Hass Avocado   220877
6          Organic Avocado   184224
7              Large Lemon   160792
8             Strawberries   149445
9                    Limes   146660
10      Organic Whole Milk   142813

In [0]:
foods = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']

def tot_ordered():
  if product_orders['product_name']==food in foods:
    return top_ten1['Ordered'] + product_orders['reordered']

In [47]:
product_orders['Total Ordered'] = product_orders.apply(tot_ordered)
product_orders['Total Ordered'].head()

TypeError: ignored

In [0]:
#I was trying to find a way to take the number of times each of the top 10 products was ordered
#and add it to the number of times each of the top 10 products was reordered

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [2]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [3]:
# table2 -> tidy
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [4]:
tidy = table2.pivot_table(columns='index')
tidy

index         treatmenta  treatmentb
Jane Doe            16.0        11.0
John Smith           NaN         2.0
Mary Johnson         3.0         1.0

In [6]:
tidy2 = tidy.reset_index()
tidy2

index         index  treatmenta  treatmentb
0          Jane Doe        16.0        11.0
1        John Smith         NaN         2.0
2      Mary Johnson         3.0         1.0

In [7]:
tidy1 = tidy2.rename(columns={
    'index': 'name',
    'treatmenta': ' a',
    'treatmentb': ' b'
})
tidy1

index          name     a     b
0          Jane Doe  16.0  11.0
1        John Smith   NaN   2.0
2      Mary Johnson   3.0   1.0

In [9]:
tidy3 = tidy1.melt(id_vars='name', value_vars=[' a', ' b'])

tidy3

           name index  value
0      Jane Doe     a   16.0
1    John Smith     a    NaN
2  Mary Johnson     a    3.0
3      Jane Doe     b   11.0
4    John Smith     b    2.0
5  Mary Johnson     b    1.0

In [10]:
final_tidy = tidy3.rename(columns={
    'name': 'Name',
    'index': 'Trt',
    'value': 'Result'
})
final_tidy

           Name Trt  Result
0      Jane Doe   a    16.0
1    John Smith   a     NaN
2  Mary Johnson   a     3.0
3      Jane Doe   b    11.0
4    John Smith   b     2.0
5  Mary Johnson   b     1.0

In [0]:
#Got stuck with syntax error for melting my pivoted table 2
#Using tidy version of original table to demonstrate changing tidy back to wide

In [0]:
#Still having syntax error, will have to review resources and video

In [0]:
#Fixed it

In [11]:
# tidy -> table2
wide = final_tidy.pivot_table(index='Trt', columns='Name', values='Result')

wide

Name  Jane Doe  John Smith  Mary Johnson
Trt
 a        16.0         NaN           3.0
 b        11.0         2.0           1.0

In [45]:
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [0]:
flights = sns.load_dataset('flights')

In [47]:
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [0]:
# Flights Pivot Table

In [52]:
flights2 = flights.pivot_table(index='year', columns='month', values='passengers')
flights2

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####